"use strict";

/* Мінмімум 2.Тобі потрібно зберігати ім’я та прізвище в змінній, 
придумай до 4-х імен змінних, що потрібні тобі для даної задачі. 
Також напиши до 5 неправильних імен (неправильні імена повинні бути закоментовані)*/
var firstName = "Sasha";
var lastName;
var f_Name;
var l_Name;
lastName = firstName; // let 1Name
// let first name
// let first-name  
// let let
// let ім'я

/*Мінімум 3.Вкажи всі можливі способи коментування коду*/
// перший спосіб коментування коду

/* другий спосіб коментування коду*/

/*Мінімум 4.Стилі написання імен змінних*/

var secName; //camelCase

var UserProfile; //PascalCase

var firs_name; //snake_case

var FNAME; //UPER_CASE

/*Норма: 1.Запитай ім’я користувача та виведи у відповідь “Привіт, *ім’я*”*/

var first_Name = prompt('Як тебе звати?', '');
alert("\u041C\u043E\u0454 \u0456\u043C'\u044F ".concat(first_Name));
/*Норма: 2.Запитай рік народження користувача, порахуй його/її вік і виведи результат. 
Поточний рік вкажи в коді як константу;*/

var age = prompt('Який рік твого народження?');
var currentYear = 2025;
alert("\u0422\u043E\u0431\u0456 ".concat(currentYear - age));
/*Норма 3.Запитай у користувача довжину сторони квадрату і виведи периметр цього квадрата*/

var squareSide = prompt('Напиши довжину сторони квадрату в см.');
alert("\u041F\u0435\u0440\u0438\u043C\u0435\u0442\u0440 \u043A\u0432\u0430\u0434\u0440\u0430\u0442\u0443 \u0434\u043E\u0440\u0456\u0432\u043D\u044E\u0454 ".concat(4 * squareSide, " \u0441\u043C."));
/*Максимум 1.Запитай у користувача радіус кола і виведи площу такої окружності.*/

var radius = prompt('Напиши радіус кола в см., я зможу порахувати площу кола');
var Pi = Math.PI;
alert("\u041F\u043B\u043E\u0449\u0430 \u043A\u043E\u043B\u0430 = ".concat(Pi * Math.pow(radius, 2), " \u0441\u043C\xB2"));
/*Максимум 2. Запитай у користувача відстань в кілометрах між двома містами і за скільки годин він хоче дістатися. 
Порахуй швидкість, з якою необхідно рухатися, щоб встигнути вчасно.*/

var distance = prompt('Напиши відстань в кілометрах між двома містами');
var timeTo = prompt('За скільки годин хочеш дістатись?');
var speed = distance / timeTo;
alert("\u0422\u043E\u0431\u0456 \u043F\u043E\u0442\u0440\u0456\u0431\u043D\u043E \u0440\u0443\u0445\u0430\u0442\u0438\u0441\u044C \u0437\u0456 \u0448\u0432\u0438\u0434\u043A\u0456\u0441\u0442\u044E ".concat(speed, " \u043A\u043C/\u0433\u043E\u0434"));
/*Максимум 3.Реалізуй конвертор валют. Користувач вводить долари, програма переводить їх в євро. 
Курс валют зберігається в константі.*/

var currencyUSD = prompt('Напиши, скільки долларів бажаєшь конвертувати');
var exchangeSellUAH = 41.35;
var exchangeBuyEUR = 49.5;
var currencyEUR = currencyUSD * exchangeSellUAH / exchangeBuyEUR;
alert("".concat(currencyUSD, " \u0434\u043E\u043B\u043B\u0430\u0440\u0456\u0432 \u0434\u043E\u0440\u0456\u0432\u043D\u044E\u0454 ").concat(currencyEUR.toFixed(2), " \u0435\u0432\u0440\u043E"));